{
  "title": "Description Wizards Messages",
  "description": "Defines messages used in various description processes. 'text' holds the actual message; 'text_class' as used here are ordinary Bootstrap classes: text-primary, text-info, text-warning, text-danger, which give additional flexibility for conveying different message kinds to the user; 'text_options' are oriented towards a more question-type message that would require the user to make a choice in response. messages used within the context of dynamically generated stages are also captured here.",
  "properties": {
    "initiate_message": {
      "text": "<strong>1.)</strong> Select a file; <strong>2.)</strong> click the <strong>Describe</strong> button to initiate the wizard, <strong>COPO-WIZ</strong>; <strong>3.)</strong> follow the stages presented by the wizard to describe your data file",
      "text_class": "text-default"
    },
    "select_files_message": {
      "text": "Please select the file you want to describe!",
      "text_class": "text-danger"
    },
    "no_destination_message": {
      "text": "Unable to determine a deposition destination for the selected file bundle at this instance. Please select your target repository from the list provided.",
      "text_class": "text-warning"
    },
    "destination_message": {
      "text": "The suggested deposition destination, <strong>{destination!s}</strong>, closely matches the selected file types. Please select an alternative destination if the suggested one is unsuitable. ",
      "text_class": "text-default"
    },
    "library_construction_message": {
      "text": "Specify the origin of the material that may have been sequenced, and any treatments that the material might have undergone that affect the sequencing result.",
      "text_class": "text-default"
    },
    "nucleic_acid_sequencing_message": {
      "text": "Specify the sequencing technique used.",
      "text_class": "text-default"
    },
    "review_message": {
      "text": "<bold>*</bold> Check the <strong>Info</strong> pane for tips on how to edit datafile attributes",
      "text_class": "text-info"
    },
    "confirm_initiate_submission": {
      "text": "The description bundle has been validated and is deemed fit for submission. <br/><br/>Do you want to initiate submission of the bundle now?",
      "text_class": "text-default"
    },
    "metadata_validation_failed": {
      "text": "Bundle items exist with incomplete metadata, and may impact submission of the bundle.<br/><br/>Do you want to describe some more?",
      "text_class": "text-default"
    },
    "empty_queue_message": {
      "text": "No description targets! Select data files to add to the description batch.",
      "text_class": "text-default"
    },
    "exit_wizard_message": {
      "text": "You have opted to exit the current description. Your entries will be saved, and you can carry on describing the datafiles at a later time. <br/><br/>Are you sure you want to exit the description?",
      "text_class": "text-default"
    },
    "confirm_bundling_action": {
      "text": "The selected datafiles will be described as a 'bundle', and may potentially be submitted together to the same repository. <br/><br/>Do you want to go ahead with the description?",
      "text_class": "text-default"
    },
    "inherit_metadata_message": {
      "text": "Some of the selected datafiles are better described than others. <br/><br/>Do you want selected datafiles with less metadata to inherit the following metadata?",
      "text_class": "text-default"
    },
    "inherit_metadata_103_message": {
      "text": "Some of the selected datafiles are ahead of items in the current description bundle, in terms of description metadata, and can be inherited from. <br/><br/>Do you want the current description bundle to inherit the following metadata? <br/><div style='color:red; margin-top:20px;'>Please note that this action might alter the wizard state, due to the upgrade in description metadata.</div>",
      "text_class": "text-default"
    },
    "incompatible_metadata_message": {
      "text": "The selected datafiles have incompatible description metadata, and may not be described as a bundle!",
      "text_class": "text-default"
    },
    "discard_description_message": {
      "text": "You have selected to discard the current description. Please note that all description metadata associated with bundle items will be deleted if you choose to proceed. <br/><br/>Are you sure you want to discard the current description?",
      "text_class": "text-default"
    },
    "delete_description_message": {
      "text": "Are you sure you want to go ahead and discard description metadata for the selected files?",
      "text_class": "text-default"
    },
    "stage_dependency_message": {
      "text": "Please note that changing this value might impact certain stages in the description process! This might, in some cases, result in loss of previous entries. <br/><br/>Do you want to continue?",
      "text_class": "text-default"
    },
    "empty_bundle_message": {
      "title": "Remove Bundle Item",
      "text": "You are about to remove an item from the description bundle. <br/><br/>If this is the last item in the bundle, then removing it will automatically exit the wizard. <br/><br/>Do you want to go ahead and remove the bundle item? ",
      "text_class": "text-warning"
    },
    "no_metadata_bundle_items": {
      "text": "There are items in the bundle with no assigned metadata for this description stage! What action do you want to take?",
      "text_class": "text-warning",
      "text_options": [
        {
          "label": "Apply current description to items with no metadata ",
          "value": "apply"
        },
        {
          "label": "Do not apply current description to items with no metadata",
          "value": "donotapply"
        }
      ]
    },
    "no_metadata_selected_bundle_items": {
      "text": "There are items in the bundle with no assigned metadata for the current description stage! <br/><br/> Do you want to move on to the next stage without supplying metadata for the affected items?",
      "text_class": "text-warning"
    },
    "metadata_selected_bundle_items": {
      "text": "Part of the selected items in the bundle may have already been assigned metadata for the current description stage! What action do you want to take?",
      "text_class": "text-warning",
      "text_options": [
        {
          "label": "Overwrite metadata for affected items in the bundle",
          "value": "overwrite"
        },
        {
          "label": "Do not overwrite metadata for affected items in the bundle",
          "value": "donotoverwrite"
        }
      ]
    },
    "metadata_bundle_items": {
      "text": "Existing metadata may have changed for items in the description bundle. <br/> How do you want to proceed?",
      "text_class": "text-warning",
      "text_options": [
        {
          "label": "Overwrite metadata for affected items in the bundle",
          "value": "overwrite"
        },
        {
          "label": "Do not overwrite metadata for affected items in the bundle",
          "value": "donotoverwrite"
        }
      ]
    },
    "apply_to_all_message": {
      "text": "Please be aware that any metadata supplied in this stage will apply to all items in the description bundle. Click <b>Next</b>, when done, to proceed.",
      "text_class": "text-info"
    },
    "description_bundle_select_message": {
      "text": "Please supply metadata for individual or group of files in the description bundle. You can click <span class='fa-stack' style='color:green; font-size:12px;'><i class='fa fa-circle fa-stack-2x'></i><i class='fa fa-plus fa-stack-1x fa-inverse'></i></span> beside a record to enter metadata, and click 'Apply to item' to commit the changes. If there are more records in the bundle, the next record will be automatically highlighted. You can also: <ol> <li>Select one or more datafiles in the bundle</li><li> Using the main form, enter metadata for the selected files</li> <li>Click the apply button to save your entries</li> <li>Repeat steps 1 - 3 for as many subsets of items in the description bundle as required</li> </ol> Click <b>Next</b>, when done, to proceed.",
      "text_class": "text-info"
    },
    "datafiles_pairing_message": {
      "text": "<ol><li>Select any two datafiles in the datafiles bundle and confirm the pairing action</li> <li>All paired files are displayed in the 'Paired Datafiles' table</li><li>You can unpair datafiles by clicking the 'unpair' button beside a paired entry</li> Click <b>Next</b>, when done pairing all datafiles, to proceed.<br/><span style='color:#a94442;'>Please note: The description bundle has been temporarily modified to display only those datafiles that may be paired.</span> ",
      "text_class": "text-info"
    },
    "singular_stage_message": {
      "text": "Please be aware that all the items in the description bundle will be assigned the same metadata in this stage.  Click <b>Next</b>, when done, to proceed.",
      "text_class": "text-info"
    },
    "unselected_bundle_items_message": {
      "text": "Please select the items in the description bundle for which the current description metadata applies.",
      "text_class": "text-warning"
    },
    "dismiss_alert_message": {
      "text": "Dismiss this notification",
      "text_class": "text-info"
    },
    "disable_alert_message": {
      "text": "Disable notifications. Use the notification icon to display notifications",
      "text_class": "text-info"
    },
    "enable_alert_message": {
      "text": "Enable notifications",
      "text_class": "text-info"
    },
    "singleton_item_alert_message": {
      "text": "Please note that all controls associated with batch description are disabled, because there is only an item in the description bundle.",
      "text_class": "text-info"
    },
    "bundling_violation_alert_message": {
      "text": "Bundle datafiles have incompatible metadata for the following <strong>constrained</strong> stage items: {}. <br/><br/><span style='color:red'>Please note that, as this is a constrained stage, any metadata supplied will be shared by all the datafiles in the description bundle. This may impact previously ascribed metadata for some of the datafiles should you choose to continue.</span>",
      "text_class": "text-danger"
    },
    "constrained_stage_alert_message": {
      "text": "<hr/><strong><span style='color:red'>Constrained stage!</span></strong> <br/>Metadata supplied in this stage will apply to all the datafiles in the description bundle.<br/><br/><strong>Attribute values in a constrained stage can potentially alter the description metadata template, and hence the sequence of steps presented by the wizard.</strong>",
      "text_class": "text-danger"
    },
    "invalid_token_message": {
      "text": "Couldn't reload description. The description may have expired, or an associated token is invalid.",
      "text_class": "text-warning"
    },
    "pooled_data_message": {
      "text": "<hr/><strong><span style='color:red'>Stage data!</span></strong> <br/>Stage data was resolved by aggregating metadata from datafiles in the bundle. You can update this to reflect current description needs.",
      "text_class": "text-warning"
    },
     "new_bundling_alert": {
      "text": "<strong><span style='color:red'>Bundling conflict!</span></strong><br/>Some of the target datafiles are already part of existing bundle. To create a new bundle you must first 'unbundle' the affected datafiles. <br/><strong>Please note that unbundling datafiles can invalidate previously recorded metadata.</strong><br/><br/>To reload a bundle, click on the target bundle under the description bundles section.",
      "text_class": "text-warning"
    },
     "cg_multiple_types_alert": {
      "text": "<hr/><strong><span style='color:red'>Multiple items type!</span></strong><br/>Please ensure that the right type is assigned to individual items in the bundle.",
      "text_class": "text-warning"
    }
  }
}