{
  "title": "Sample Description Wizard Messages",
  "description": "Defines messages used in the sample description process. 'text' holds the actual message; 'text_class' as used here are ordinary Bootstrap classes: text-primary, text-info, text-warning, text-danger, which give additional flexibility for conveying different message kinds to the user; 'text_options' are oriented towards a more question-type message that would require the user to make a choice in response. messages used within the context of dynamically generated stages are also captured here.",
  "properties": {
    "save_cell_message": {
      "text": "Wrap up action interrupted due to an active cell edit! Please Save or Cancel active cell edit and retry",
      "text_class": "text-default"
    },
    "confirm_initial_sample_generation": {
      "title": "Sample Generation",
      "text": "The specified number of samples will now be generated using the sample attributes you've entered. <br/><br/>Click <strong>Continue</strong> if you are happy to go ahead and generate the samples. <br/>Note: In the next stage, you will be able to modify attribute values for individual samples. <br/>Click <strong>Review</strong> to modify the attributes entries you've so far made.",
      "text_class": "text-default"
    },
    "review_message": {
      "text": "In this stage, you will be able modify specific attribute values for your samples. To modify an attribute value, highlight the required cell and press the 'Enter' key. When done modifying the value in a cell, press the 'Enter' key again to save your changes. <br/><br/>Click <strong>Finish!</strong> when you are done with your changes to terminate the description session.",
      "text_class": "text-default"
    },
    "confirm_initiate_submission": {
      "text": "The description bundle has been validated and is deemed fit for submission. <br/><br/>Do you want to initiate submission of the bundle now?",
      "text_class": "text-default"
    },
    "metadata_validation_failed": {
      "text": "Bundle items exist with incomplete metadata, and may impact submission of the bundle.<br/><br/>Do you want to describe some more?",
      "text_class": "text-default"
    },
    "exit_wizard_message": {
      "title": "Discard Description",
      "text": "Are you sure you want to discard the current description?",
      "text_class": "text-default"
    },
    "discard_description_message": {
      "text": "You have selected to discard description. Please note that all description metadata associated with bundle items will be permanently removed from the system. <br/><br/>Are you sure you want to discard description?",
      "text_class": "text-default"
    },
    "delete_description_message": {
      "text": "Are you sure you want to go ahead and delete description metadata for the selected files? <br/><div style='color:red; margin-top:20px;'>Please note that files currently being described will not be affected by this action.</div>",
      "text_class": "text-default"
    },
    "dismiss_alert_message": {
      "text": "Dismiss this notification",
      "text_class": "text-info"
    },
    "disable_alert_message": {
      "text": "Disable notifications. Use the notification icon to display notifications",
      "text_class": "text-info"
    },
    "enable_alert_message": {
      "text": "Enable notifications",
      "text_class": "text-info"
    }
  }
}