{
  "title": "Sample Description Wizard Messages",
  "description": "Defines messages used in the sample description process. 'text' holds the actual message; 'text_class' as used here are ordinary Bootstrap classes: text-primary, text-info, text-warning, text-danger, which give additional flexibility for conveying different message kinds to the user; 'text_options' are oriented towards a more question-type message that would require the user to make a choice in response. messages used within the context of dynamically generated stages are also captured here.",
  "properties": {
    "save_cell_message": {
      "text": "Wrap up action interrupted due to an active cell edit! Please Save or Cancel active cell edit and retry",
      "text_class": "text-default"
    },
    "confirm_initial_sample_generation": {
      "title": "Sample Generation",
      "text": "The specified number of samples will now be generated using the sample attributes you've entered. <br/><br/>Click <strong>Continue</strong> if you are happy to go ahead and generate the samples. <br/>Note: In the next stage, you will be able to modify attribute values for individual samples or group of samples. <br/>Click <strong>Review</strong> to modify the attributes entries you've so far made.",
      "text_class": "text-default"
    },
    "review_message": {
      "text": "Description metadata for your samples are presented below as discrete attribute values. You can modify specific attribute values for individual samples. Additionally, you can batch-update attribute values for groups of samples. <ul><li>To update attribute value for a single sample: <ol><li>Click to focus on a cell (note: this action is different from row selection)</li><li>Double-click or press 'Enter' on a focused cell to make it editable</li><li>Make your changes and double-click or press 'Enter' again to save your changes</li></ol><li>To batch-update corresponding attribute values for a group of samples:<ol><li>Click to focus on a target cell, the value of which will be used to update corresponding cells of selected records</li><li>Click the checkbox beside required rows; selected rows will form the update batch</li><li>Click the 'Update selected records' button</li></ol></li><li>Click <strong>Next</strong>, when done editing, to proceed to the final stage</li></ul>",
      "text_class": "text-default"
    },
    "confirm_initiate_submission": {
      "text": "The description bundle has been validated and is deemed fit for submission. <br/><br/>Do you want to initiate submission of the bundle now?",
      "text_class": "text-default"
    },
    "metadata_validation_failed": {
      "text": "Bundle items exist with incomplete metadata, and may impact submission of the bundle.<br/><br/>Do you want to describe some more?",
      "text_class": "text-default"
    },
    "exit_wizard_message": {
      "title": "Discard Description",
      "text": "Are you sure you want to discard the current description?",
      "text_class": "text-default"
    },
    "dismiss_alert_message": {
      "text": "Dismiss this notification",
      "text_class": "text-info"
    },
    "disable_alert_message": {
      "text": "Disable notifications. Use the notification icon to display notifications",
      "text_class": "text-info"
    },
    "enable_alert_message": {
      "text": "Enable notifications",
      "text_class": "text-info"
    }
  }
}